# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'blendle/blendle'

# Binaries
brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure



# Development
brew 'php'
brew 'php@7.3'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'node'
brew 'yarn'
brew 'vault'
brew 'kns'
brew 'stern'
brew 'helm'
brew 'go'
brew 'gitleaks'
brew 'terraform'
brew 'helm@2'
brew 'youtube-dl'

# Apps
cask 'caffeine'
cask 'iterm2'
cask 'docker'
cask 'github'
cask 'clipy'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'postman'
cask 'notion'
cask 'phpstorm'
cask 'goland'
cask 'skype'
cask 'slack'
cask 'evernote'
cask 'dropbox'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'there'
cask 'vlc'
cask 'whatsapp'
cask 'appcleaner'
cask 'openvpn-connect'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'